#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazapi_resource.key_vault_secret_github_pat: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/secrets/datafactory-shir-auth-key][0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dpml-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dpml-rt001][0m
[0m[1mazurerm_service_plan.service_plan: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001][0m
[0m[1mazapi_resource.subnet_container: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/ContainerSubnet][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/shir-dev-uai001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Reading...[0m[0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_service_plan: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mazurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001|logAnalytics][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001/providers/Microsoft.Authorization/roleAssignments/8f07e442-d1db-2c47-43b7-40bc5f18f137][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001|logAnalytics][0m
[0m[1mazurerm_windows_web_app.windows_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001][0m
[0m[1mazurerm_private_endpoint.windows_web_app_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Network/privateEndpoints/shir-dev-asp001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001|logAnalytics][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
        id                          = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001/integrationruntimes/SelfhostedIntegrationRuntime001"
        name                        = "SelfhostedIntegrationRuntime001"
      [31m-[0m[0m primary_authorization_key   = "IR@aeb5b129-6525-4357-80d7-0c22ac9dc0be@shir-dev-adf001@ServiceEndpoint=shir-dev-adf001.northeurope.datafactory.azure.net@XYM9SH8eNcL94fZxjph/+W8sHGdABTyp95JEuoVt1cM=" [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_windows_web_app[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_windows_web_app" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001"
    }

[1m  # azurerm_data_factory.data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory" "data_factory" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
        name                            = "shir-dev-adf001"
      [33m~[0m[0m public_network_enabled          = true [33m->[0m[0m false
      [33m~[0m[0m tags                            = {
          [32m+[0m[0m "workload" = "shir-runners"
        }
        [90m# (3 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_data_factory_integration_runtime_self_hosted.data_factory_integration_runtime_self_hosted[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_integration_runtime_self_hosted" "data_factory_integration_runtime_self_hosted" {
      [32m+[0m[0m data_factory_id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
      [32m+[0m[0m description                 = "Self-Hosted Integration Runtime 001"
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m name                        = "SelfhostedIntegrationRuntime001"
      [32m+[0m[0m primary_authorization_key   = (known after apply)
      [32m+[0m[0m secondary_authorization_key = (known after apply)
    }

[1m  # azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001"
        name                            = "shir-dev-kv001"
      [33m~[0m[0m public_network_access_enabled   = true [33m->[0m[0m false
        tags                            = {
            "workload" = "shir-runners"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action             = "Allow" [33m->[0m[0m "Deny"
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_shir_key[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_shir_key" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001"
      [32m+[0m[0m name                    = "datafactory-shir-auth-key"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_data_factory" {
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (3 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (3 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_service_plan[0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_service_plan" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU"
      [32m+[0m[0m name                           = "logAnalytics"
      [32m+[0m[0m target_resource_id             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/serverFarms/shir-dev-asp001"

      [32m+[0m[0m metric {
          [32m+[0m[0m category = "AllMetrics"
          [32m+[0m[0m enabled  = true
        }
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_windows_web_app" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_private_endpoint.data_factory_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "data_factory_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "shir-dev-adf001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "shir-dev-adf001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "shir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "shir-dev-adf001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.datafactory.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "shir-dev-adf001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.DataFactory/factories/shir-dev-adf001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "dataFactory",
            ]
        }
    }

[1m  # azurerm_private_endpoint.key_vault_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "key_vault_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "shir-dev-kv001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "shir-dev-kv001-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "shir-dev-shir-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dpml-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dpml-vnet001/subnets/PrivateEndpointSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "workload" = "shir-runners"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "shir-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "shir-dev-kv001-pe"
          [32m+[0m[0m private_connection_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.KeyVault/vaults/shir-dev-kv001"
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # azurerm_windows_web_app.windows_web_app[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_windows_web_app" "windows_web_app" {
      [33m~[0m[0m app_settings                                   = {
          [31m-[0m[0m "AE_TIME"                             = "600"
          [31m-[0m[0m "AUTH_KEY"                            = "IR@ce790ba8-f98b-409a-9e62-934ff3c0937b@shir-dev-adf001@ServiceEndpoint=shir-dev-adf001.northeurope.datafactory.azure.net@lH6l2iP/uDUfdfJPAheqanRjBzfBHTqFID6ebOOGtKs="
          [31m-[0m[0m "ENABLE_AE"                           = "false"
          [31m-[0m[0m "ENABLE_HA"                           = "false"
          [31m-[0m[0m "HA_PORT"                             = "8060"
          [31m-[0m[0m "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "false"
          [31m-[0m[0m "WEBSITE_CONTENTOVERVNET"             = "1"
          [31m-[0m[0m "WEBSITE_DNS_SERVER"                  = "10.0.0.4"
        } -> (known after apply)
        id                                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/shir-dev-shir-rg/providers/Microsoft.Web/sites/shir-dev-asp001"
        name                                           = "shir-dev-asp001"
      [33m~[0m[0m public_network_access_enabled                  = true [33m->[0m[0m false
        tags                                           = {
            "workload" = "shir-runners"
        }
        [90m# (20 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m logs {
          [31m-[0m[0m detailed_error_messages = false [90m-> null[0m[0m
          [31m-[0m[0m failed_request_tracing  = false [90m-> null[0m[0m

          [31m-[0m[0m application_logs {
              [31m-[0m[0m file_system_level = "Error" [90m-> null[0m[0m
            }
        }

      [31m-[0m[0m sticky_settings {
          [31m-[0m[0m app_setting_names       = [
              [31m-[0m[0m "APPINSIGHTS_INSTRUMENTATIONKEY",
              [31m-[0m[0m "APPLICATIONINSIGHTS_CONNECTION_STRING ",
              [31m-[0m[0m "APPINSIGHTS_PROFILERFEATURE_VERSION",
              [31m-[0m[0m "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              [31m-[0m[0m "ApplicationInsightsAgent_EXTENSION_VERSION",
              [31m-[0m[0m "XDT_MicrosoftApplicationInsights_BaseExtensions",
              [31m-[0m[0m "DiagnosticServices_EXTENSION_VERSION",
              [31m-[0m[0m "InstrumentationEngine_EXTENSION_VERSION",
              [31m-[0m[0m "SnapshotDebugger_EXTENSION_VERSION",
              [31m-[0m[0m "XDT_MicrosoftApplicationInsights_Mode",
              [31m-[0m[0m "XDT_MicrosoftApplicationInsights_PreemptSdk",
              [31m-[0m[0m "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              [31m-[0m[0m "XDT_MicrosoftApplicationInsightsJava",
              [31m-[0m[0m "XDT_MicrosoftApplicationInsights_NodeJS",
            ] [90m-> null[0m[0m
          [31m-[0m[0m connection_string_names = [] [90m-> null[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 5 to add, 6 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>